code/cluster/published/current/raw/2026-03-17_localhost_fabric_canonical_localhost_vllm_serve_sweep/repeat_1/conc1_bench.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7446fbe4de40>, trust_remote_code=False, seed=0, num_prompts=10, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8888', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='openai-community/gpt2', input_len=64, output_len=32, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results', result_filename='conc1_isl64_osl32_tp1.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-26e20c77-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False)
INFO 03-17 02:51:11 [datasets.py:626] Sampling input_len from [64, 64] and output_len from [32, 32]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1

  0%|          | 0/10 [00:00<?, ?it/s]
 10%|█         | 1/10 [00:00<00:02,  3.84it/s]
 20%|██        | 2/10 [00:00<00:01,  4.50it/s]
 30%|███       | 3/10 [00:00<00:01,  4.82it/s]
 40%|████      | 4/10 [00:00<00:01,  4.97it/s]
 50%|█████     | 5/10 [00:01<00:00,  5.08it/s]
 60%|██████    | 6/10 [00:01<00:00,  5.18it/s]
 70%|███████   | 7/10 [00:01<00:00,  5.20it/s]
 80%|████████  | 8/10 [00:01<00:00,  5.23it/s]
 90%|█████████ | 9/10 [00:01<00:00,  5.19it/s]
100%|██████████| 10/10 [00:01<00:00,  5.18it/s]
100%|██████████| 10/10 [00:01<00:00,  5.05it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     10
Failed requests:                         0
Maximum request concurrency:             1
Benchmark duration (s):                  1.98
Total input tokens:                      640
Total generated tokens:                  320
Request throughput (req/s):              5.05
Output token throughput (tok/s):         161.50
Peak output token throughput (tok/s):    162.00
Peak concurrent requests:                6.00
Total token throughput (tok/s):          484.49
---------------Time to First Token----------------
Mean TTFT (ms):                          27.00
Median TTFT (ms):                        21.04
P99 TTFT (ms):                           77.57
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          5.51
Median TPOT (ms):                        5.50
P99 TPOT (ms):                           5.71
---------------Inter-token Latency----------------
Mean ITL (ms):                           5.64
Median ITL (ms):                         5.71
P99 ITL (ms):                            7.31
==================================================